
var reg_int0= /^\d+$/　　//非负整数（正整数 + 0） 
var reg_int=/^[0-9]*[1-9][0-9]*$/　　//正整数 
var reg_minusint0=/^((-\d+)|(0+))$/　　//非正整数（负整数 + 0） 
var reg_minusint=/^-[0-9]*[1-9][0-9]*$/　　//负整数 
var reg_int=/^-?\d+$/　　　　//整数 
var reg_float0 =/^\d+(\.\d+)?$/　　//非负浮点数（正浮点数 + 0） 
var reg_float = /^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$/　　//正浮点数 
var reg_minusfloat0=/^((-\d+(\.\d+)?)|(0+(\.0+)?))$/　　//非正浮点数（负浮点数 + 0） 
var reg_minusfloat=/^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$/　　//负浮点数 
var reg_float = /^(-?\d+)(\.\d+)?$/　　//浮点数 